{"class_name": "Sequential", "keras_version": "2.2.0", "config": [{"class_name": "Embedding", "config": {"activity_regularizer": null, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "seed": null, "maxval": 0.05}}, "name": "embedding_3", "embeddings_regularizer": null, "trainable": true, "dtype": "float32", "batch_input_shape": [null, 1000], "embeddings_constraint": null, "output_dim": 32, "input_length": 1000, "mask_zero": false, "input_dim": 24374}}, {"class_name": "LSTM", "config": {"kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "return_sequences": true, "use_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "unroll": false, "bias_constraint": null, "unit_forget_bias": true, "activation": "tanh", "stateful": false, "units": 100, "recurrent_activation": "hard_sigmoid", "recurrent_regularizer": null, "name": "lstm_4", "go_backwards": false, "activity_regularizer": null, "return_state": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "trainable": true, "recurrent_constraint": null, "implementation": 1, "recurrent_dropout": 0.2, "dropout": 0.2}}, {"class_name": "LSTM", "config": {"kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "return_sequences": false, "use_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "unroll": false, "bias_constraint": null, "unit_forget_bias": true, "activation": "tanh", "stateful": false, "units": 50, "recurrent_activation": "hard_sigmoid", "recurrent_regularizer": null, "name": "lstm_5", "go_backwards": false, "activity_regularizer": null, "return_state": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "trainable": true, "recurrent_constraint": null, "implementation": 1, "recurrent_dropout": 0.0, "dropout": 0.0}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "name": "dense_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_constraint": null, "trainable": true, "activation": "softmax", "units": 2, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_regularizer": null}}], "backend": "tensorflow"}