{"class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Dense", "config": {"dtype": "float32", "batch_input_shape": [null, 1000], "activity_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "use_bias": true, "units": 128, "name": "dense_3", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "use_bias": true, "units": 128, "name": "dense_4", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "bias_constraint": null, "activation": "softmax", "trainable": true, "use_bias": true, "units": 2, "name": "dense_5", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.4000000059604645, "l1": 0.0}}}}], "keras_version": "2.2.0"}