{"keras_version": "2.2.0", "config": [{"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "bias_constraint": null, "kernel_constraint": null, "name": "dense_5", "bias_regularizer": null, "use_bias": true, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "batch_input_shape": [null, 1001], "units": 128, "dtype": "float32", "activity_regularizer": null, "trainable": true, "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "bias_constraint": null, "kernel_constraint": null, "name": "dense_6", "bias_regularizer": null, "use_bias": true, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 64, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "bias_constraint": null, "kernel_constraint": null, "name": "dense_7", "bias_regularizer": null, "use_bias": true, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 32, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "bias_constraint": null, "kernel_constraint": null, "name": "dense_8", "bias_regularizer": null, "use_bias": true, "activation": "softmax", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 2, "activity_regularizer": null, "trainable": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.4000000059604645}}}}], "backend": "tensorflow", "class_name": "Sequential"}