{"config": [{"config": {"embeddings_regularizer": null, "embeddings_constraint": null, "input_dim": 24374, "batch_input_shape": [null, 1000], "trainable": true, "activity_regularizer": null, "embeddings_initializer": {"config": {"seed": null, "minval": -0.05, "maxval": 0.05}, "class_name": "RandomUniform"}, "output_dim": 32, "dtype": "float32", "input_length": 1000, "mask_zero": false, "name": "embedding_1"}, "class_name": "Embedding"}, {"config": {"activation": "tanh", "go_backwards": false, "kernel_constraint": null, "dropout": 0.0, "use_bias": true, "units": 100, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "kernel_regularizer": null, "recurrent_dropout": 0.0, "unit_forget_bias": true, "recurrent_regularizer": null, "activity_regularizer": null, "stateful": false, "return_sequences": false, "bias_regularizer": null, "unroll": false, "recurrent_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "implementation": 1, "return_state": false, "recurrent_activation": "hard_sigmoid", "name": "lstm_1"}, "class_name": "LSTM"}, {"config": {"activation": "softmax", "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "trainable": true, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "kernel_regularizer": null, "units": 2, "kernel_constraint": null, "name": "dense_1"}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.2.0"}